create table item_type
(item_typeid int,
 item_color int primary key(item_typeid,item_color),
 item_typename varchar(20),
 item_colorname varchar(20),
 item_worth int,
 item_box int,
 item_boxname varchar(20),
 item_level int,
 item_levelname varchar(20)
 ) 
 
 ,'1','普通'
 ,'2','稀有'
 ,'3','史诗'
 ,'4','传说'
 insert into item_type values
 (1,1,'刺刀','无涂装',1000,1,'幻影箱子' ,'3','史诗'),
 (1,2,'刺刀','多普勒',1300,1,'幻影箱子','4','传说'),
 (1,3,'刺刀','深红之网',1500,1,'幻影箱子','4','传说'),
 (1,4,'刺刀','渐变之色',1700,1,'幻影箱子','4','传说');

 insert into item_type values
 (2,1,'爪子刀','无涂装',1500,2,'狩猎箱子','3','史诗'),
 (2,2,'爪子刀','多普勒',2400,2,'狩猎箱子' ,'4','传说'),
 (2,3,'爪子刀','深红之网',3600,2,'狩猎箱子' ,'4','传说'),
 (2,4,'爪子刀','渐变之色',3400,2,'狩猎箱子' ,'4','传说')

  insert into item_type values
 (3,1,'蝴蝶刀','无涂装',1600,3,'突围箱子','3','史诗'),
 (3,2,'蝴蝶刀','多普勒',2800,3,'突围箱子','4','传说'),
 (3,3,'蝴蝶刀','深红之网',1700,3,'突围箱子','4','传说'),
 (3,4,'蝴蝶刀','渐变之色',3500,3,'突围箱子','4','传说')

   insert into item_type values
 (4,1,'暗影双匕','无涂装',500,4,'光谱箱子','3','史诗'),
 (4,2,'暗影双匕','多普勒',800,4,'光谱箱子','4','传说'),
 (4,3,'暗影双匕','深红之网',600,4,'光谱箱子','4','传说'),
 (4,4,'暗影双匕','渐变之色',800,4,'光谱箱子','4','传说')

 insert into item_type values
 (5,1,'USP消音版','次时代',20,1,'幻影箱子' ,'1','普通'),
 (5,2,'USP消音版','枪响人亡',200,1,'幻影箱子' ,'3','史诗'),
 (5,3,'USP消音版','脑洞大开',50,1,'幻影箱子' ,'2','稀有'),
 (5,4,'USP消音版','黑色魅影',100,1,'幻影箱子' ,'2','稀有')
 
 insert into item_type values
 (6,1,'格洛克18型','鼹鼠',14,2,'狩猎箱子' ,'1','普通'),
 (6,2,'格洛克18型','城里的月光',18,2,'狩猎箱子' ,'1','普通'),
 (6,3,'格洛克18型','水灵',70,2,'狩猎箱子','2','稀有'),
 (6,4,'格洛克18型','渐变之色',2000,2,'狩猎箱子' ,'3','史诗')

   insert into item_type values
 (7,1,'R8左轮','渐变琥珀',4,3,'突围箱子' ,'1','普通'),
 (7,2,'R8左轮','重新启动',15,3,'突围箱子' ,'2','稀有'),
 (7,3,'R8左轮','深红之网',28,3,'突围箱子' ,'2','稀有'),
 (7,4,'R8左轮','渐变之色',26,3,'突围箱子' ,'2','稀有')

 insert into item_type values
 (8,1,'沙漠之鹰','青铜装饰',5,4,'光谱箱子' ,'1','普通'),
 (8,2,'沙漠之鹰','日落风暴',150,4,'光谱箱子' ,'2','稀有'),
 (8,3,'沙漠之鹰','深红之网',380,4,'光谱箱子' ,'3','史诗'),
 (8,4,'沙漠之鹰','炽烈之炎',760,4,'光谱箱子' ,'3','史诗')

 insert into item_type values
 (9,1,'M4A4','龙王',100,1,'幻影箱子' ,'2','稀有'),
 (9,2,'M4A4','二西莫夫',400,1,'幻影箱子' ,'3','史诗'),
 (9,3,'M4A4','波塞冬',1400,1,'幻影箱子' ,'3','史诗'),
 (9,4,'M4A4','咆哮',6000,1,'幻影箱子' ,'4','传说')
 
 insert into item_type values
 (10,1,'M4A1','毁灭者',80,2,'狩猎箱子' ,'2','稀有'),
 (10,2,'M4A1','伊卡洛斯陨落',300,2,'狩猎箱子' ,'3','史诗'),
 (10,3,'M4A1','暴怒野兽',400,2,'狩猎箱子' ,'3','史诗'),
 (10,4,'M4A1','赤红新星',500,2,'狩猎箱子' ,'3','史诗')

   insert into item_type values
 (11,1,'AK47','血腥运动',300,3,'突围箱子' ,'2','稀有'),
 (11,2,'AK47','表面淬火',500,3,'突围箱子' ,'3','史诗'),
 (11,3,'AK47','皇后',700,3,'突围箱子' ,'3','史诗'),
 (11,4,'AK47','二西莫夫',1000,3,'突围箱子' ,'3','史诗')

 insert into item_type values
 (12,1,'AWP','浮生如梦',50,4,'光谱箱子' ,'2','稀有'),
 (12,2,'AWP','二西莫夫',300,4,'光谱箱子' ,'3','史诗'),
 (12,3,'AWP','黑色魅影',400,4,'光谱箱子' ,'3','史诗'),
 (12,4,'AWP','巨龙传说',9000,4,'光谱箱子' ,'4','传说')

  insert into item_type values
 (13,1,'UMP45','车王',3,1,'幻影箱子' ,'1','普通'),
 (13,2,'UMP45','剑齿虎',50,1,'幻影箱子' ,'2','稀有'),
 (13,3,'UMP45','动量',55,1,'幻影箱子' ,'2','稀有'),
 (13,4,'UMP45','炽烈之炎',80,1,'幻影箱子' ,'2','稀有')
 
 insert into item_type values
 (14,1,'P90','夺命器',10,2,'狩猎箱子' ,'1','普通'),
 (14,2,'P90','三角',30,2,'狩猎箱子','1','普通'),
 (14,3,'P90','二西莫夫',150,2,'狩猎箱子' ,'3','史诗'),
 (14,4,'P90','喵之萌杀',200,2,'狩猎箱子' ,'3','史诗')

 

 SELECT * FROM item_type